app/controllers/containers_controller.rb

SELECT "containers".* FROM "containers"
---
  def index
    containers = Container.all

SELECT  "containers".* FROM "containers" WHERE "containers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # storage_foods = storage.foods
    container = Container.find(params[:id])