app/controllers/foods_controller.rb

  def index
    foods = Food.all
---
SELECT "foods".* FROM "foods"

  def fridge
    foods = Food.where(storage_id: 1)
---
SELECT "foods".* FROM "foods" WHERE "foods"."storage_id" = $1  [["storage_id", 1]]

  def freezer
    foods = Food.where(storage_id: 2)
---
SELECT "foods".* FROM "foods" WHERE "foods"."storage_id" = $1  [["storage_id", 2]]

  def pantry
    foods = Food.where(storage_id: 3)
---
SELECT "foods".* FROM "foods" WHERE "foods"."storage_id" = $1  [["storage_id", 3]]

  def box
    foods = Food.where(container_id: 1)
---
SELECT "foods".* FROM "foods" WHERE "foods"."container_id" = $1  [["container_id", 1]]

  def can
    foods = Food.where(container_id: 2)
---
SELECT "foods".* FROM "foods" WHERE "foods"."container_id" = $1  [["container_id", 2]]

  def bag
    foods = Food.where(container_id: 3)
---
SELECT "foods".* FROM "foods" WHERE "foods"."container_id" = $1  [["container_id", 3]]

  def show
    food = Food.find(params[:id])
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def create
    food = Food.new(food_params)
    food.storage_id = params[:storage_id]
    food.container_id = params[:container_id]
    food.user_id = params[:user_id]

    if food.save
---
INSERT INTO "foods" ("name", "purchased_date", "experation_date", "storage_id", "container_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Cheese"], ["purchased_date", "2018-05-23"], ["experation_date", "2018-05-30"], ["storage_id", 1], ["container_id", 3], ["user_id", 1]]

  def update
    food = Food.find(params[:id])
    food.update(food_params)
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "foods" SET "container_id" = $1 WHERE "foods"."id" = $2  [["container_id", 2], ["id", 11]]

  def destroy
    food = Food.destroy(params[:id])
---
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 30]]