app/controllers/foods_controller.rb

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    food = Food.find(params[:id])

INSERT INTO "foods" ("name", "purchased_date", "experation_date", "storage_id", "container_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Burger"], ["purchased_date", "2018-04-11"], ["experation_date", "2018-04-18"], ["storage_id", 2], ["container_id", 1]]
---
  def create
    food = Food.new(food_params)
    food.storage_id = params[:storage_id]
    food.container_id = params[:container_id]

    if food.save

UPDATE "foods" SET "container_id" = $1 WHERE "foods"."id" = $2  [["container_id", 2], ["id", 11]]
---
  def update
    food = Food.find(params[:id])
    food.update(food_params)

DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 9]]
---
  def destroy
    food = Food.destroy(params[:id])