app/controllers/storages_controller.rb

SELECT "storages".* FROM "storages"
---
  def index
    storages = Storage.all

SELECT  "storages".* FROM "storages" WHERE "storages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # storage_foods = storage.foods
    storage = Storage.find(params[:id])